<template>
  <section class="services" id="services">
      <div class="container">
          <h1>Услуги</h1>
          <div class="services__navbar">
              <a href="#" class="services__navbar__btn active-btn" data-target="walking">Пешком</a>
              <a href="#" class="services__navbar__btn" data-target="car">Автомобиль</a>
              <a href="#" class="services__navbar__btn" data-target="cargo">Грузовой</a>
          </div>
          <div class="services__block" id="walkingContent">
            <div class="services__block__title">
              <img src="/images/services-page/walking-delivery.jpg" alt="">
              <p>Пешая доставка — это идеальное решение для городских условий, где плотный трафик и пробки могут существенно замедлить передвижение автотранспорта. Наша служба «Туда-Сюда» предоставляет услуги пешей доставки, обеспечивая быстрый и эффективный способ доставить ваши мелкие и средние посылки в самые кратчайшие сроки.</p>
            </div>
            <p>Пешая доставка — это идеальное решение для городских условий, где плотный трафик и пробки могут существенно замедлить передвижение автотранспорта. Наша служба «Туда-Сюда» предоставляет услуги пешей доставки, обеспечивая быстрый и эффективный способ доставить ваши мелкие и средние посылки в самые кратчайшие сроки.
              <br><br>
              Пешая доставка особенно удобна для доставки документов, мелких посылок и товаров из магазинов. Это экологически чистый способ доставки, который снижает выбросы углекислого газа и не создает шума, что особенно важно в крупных городах с высоким уровнем загрязнения и шумовым фоном.
              <br><br>
              Мы обеспечиваем высокий уровень безопасности ваших посылок. Все наши курьеры проходят тщательный отбор и регулярные проверки, что гарантирует надежность и добросовестность при выполнении заказов. Кроме того, мы предлагаем услугу страхования посылок, что дополнительно защищает ваши отправления.</p>
          </div>
          <div class="services__block" id="carContent" style="display: none;">
              <div class="services__block__title">
                <img src="/images/services-page/car-delivery.jpg" alt="">
                <p>Автомобильная доставка от «Туда-Сюда» — это быстрый и надежный способ доставить ваши крупные и средние посылки по городу и за его пределы. Наш автопарк состоит из современных автомобилей, оборудованных для безопасной и оперативной доставки, что позволяет нам выполнять заказы любой сложности и объема.</p>
              </div>
              <p>Наши водители — это профессионалы с многолетним опытом, которые отлично знают город и пригородные маршруты. Они используют GPS-навигацию для выбора оптимальных маршрутов, что позволяет избежать пробок и сократить время доставки. Мы гарантируем, что ваши заказы будут доставлены в кратчайшие сроки, независимо от погодных условий и дорожной ситуации.
                <br><br>
                Автомобильная доставка идеально подходит для транспортировки крупных посылок, бытовой техники, мебели, стройматериалов и других товаров, которые требуют аккуратного обращения и надежного транспортного средства. Наши автомобили оборудованы специальными креплениями и амортизаторами, что позволяет избежать повреждений и сохранить целостность груза во время транспортировки.
                <br><br>
                Мы обеспечиваем полную безопасность ваших отправлений. Все наши автомобили оборудованы системами слежения, что позволяет отслеживать местоположение груза в режиме реального времени. Вы будете получать уведомления на каждом этапе доставки, что позволяет контролировать процесс и быть в курсе всех событий.
                <br><br>
                Доставка на авто от «Туда-Сюда» — это надежный выбор для тех, кто ценит время и безопасность. Мы гарантируем высокое качество обслуживания и индивидуальный подход к каждому клиенту. Доверьте нам ваши грузы, и мы доставим их быстро и безопасно.</p>
          </div>
          <div class="services__block" id="cargoContent" style="display: none;">
              <div class="services__block__title">
                <img src="/images/services-page/cargo-delivery.jpg" alt="">
                <p>Грузовая доставка от «Туда-Сюда» — это профессиональный и надежный сервис для транспортировки крупногабаритных и тяжеловесных грузов. Наш автопарк включает в себя грузовики различных типов и размеров, которые позволяют выполнять заказы любой сложности и объема. Мы предлагаем комплексные решения для бизнеса и частных лиц, обеспечивая оперативную и безопасную доставку.</p>
              </div>
              <p>Наши водители и грузчики — это опытные специалисты, прошедшие специальное обучение. Они знают все нюансы транспортировки грузов, включая правильную укладку, крепление и защиту от повреждений. Мы используем современное оборудование и материалы для упаковки, что гарантирует сохранность вашего груза на протяжении всего пути.
                <br><br>
                Грузовая доставка идеально подходит для перевозки товаров для магазинов, строительных материалов, мебели, оборудования и других крупногабаритных предметов. Мы предлагаем как разовые услуги, так и долгосрочное сотрудничество для регулярных перевозок. Наши услуги включают погрузочно-разгрузочные работы, что избавляет вас от необходимости искать дополнительных работников.
                <br><br>
                Мы понимаем, насколько важна своевременность доставки, особенно для бизнеса. Поэтому мы разработали систему отслеживания, которая позволяет вам контролировать процесс в режиме реального времени. Вы будете получать уведомления в личном кабинете на каждом этапе доставки и сможете оперативно реагировать на любые изменения. Это обеспечивает прозрачность и надежность нашего сервиса.
                <br><br>
                Наши грузовые автомобили оборудованы системами слежения и контроля, что позволяет выбирать оптимальные маршруты и избегать пробок. Мы гарантируем доставку в установленные сроки, независимо от условий на дорогах. Все грузы застрахованы, что дополнительно защищает ваши отправления от непредвиденных ситуаций.
                <br><br> 
                Грузовая доставка от «Туда-Сюда» — это ваш надежный партнер в вопросах транспортировки. Мы предлагаем индивидуальный подход к каждому клиенту, учитываем все пожелания и требования. Наши услуги позволяют вам сосредоточиться на основном бизнесе, доверив транспортировку профессионалам. Выбирайте качество и надежность вместе с «Туда-Сюда».</p>
            </div>
      </div>
  </section>
</template>


<script>
export default {
    data() {
        return {
            activeButton: 'walking'
        };
    },
    mounted() {
        // Инициализация: показываем начально активный контент
        this.showContent(this.activeButton);
        
        // Обработчики событий для переключения контента по клику на кнопки
        const buttons = document.querySelectorAll('.services__navbar__btn');
        buttons.forEach(button => {
            button.addEventListener('click', (event) => {
                event.preventDefault();
                const target = button.getAttribute('data-target');
                this.showContent(target);
                this.updateActiveButton(button);
            });
        });
    },
    methods: {
        showContent(target) {
            // Скрываем все блоки контента
            document.querySelectorAll('.services__block').forEach(block => {
                block.style.display = 'none';
            });
            // Показываем выбранный блок контента
            document.getElementById(`${target}Content`).style.display = 'block';
            // Обновляем активную кнопку
            this.activeButton = target;
        },
        updateActiveButton(button) {
            // Снимаем класс активной кнопки со всех кнопок
            document.querySelectorAll('.services__navbar__btn').forEach(btn => {
                btn.classList.remove('active-btn');
            });
            // Добавляем класс активной кнопки к выбранной кнопке
            button.classList.add('active-btn');
        }
    }
};

</script>
            
            <style scoped>
            @import '/src/styles/main.scss';
            </style>